In [1]:
##PREP For charts-import csv files, clean/check data, merge DF, check more things to prep for a chart and making more DFs
#for those chart

In [18]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

#this is so you can use os.path.join() later to load csv files  you need this module 
import os

In [19]:
# Files to load  CITY DATA AND RIDE DATA 
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [20]:
#CITY DATA
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [21]:
#RIDE DATA DF 
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [22]:
#CITY DATA DF 
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [23]:
#CITY DATA DF 
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [24]:
#CITY DATA DF 
# Get the data types of each column.  ok because driver count is an integer for later calcs
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [25]:
#CITY DATA DF 
# Get the unique values of the type of city. unique method on specific column which will 
#return an array or list of all the uniqu values of that column  - the catgories kind of
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [26]:
#CITY DATA DF 
# Get the number of data points from the Urban cities
#use sum to get number of data pointf for the urban city.
sum(city_data_df["type"]=="Urban")

66

In [27]:
sum(city_data_df["type"]=="Suburban")

36

In [28]:
sum(city_data_df["type"]=="Rural")

18

In [29]:
#RIDE DATA DF 
# Get the columns and the rows that are not null. 
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [30]:
#RIDE DATA DF 
# Get the columns and the rows that are not null, if any  - ideally is zero
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [31]:
#RIDE DATA DF 
# Get the data types of each column.  ok because fare is floating and ride id is integer
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [32]:
#MERGE the City and Ride DATA -new dataset is called  PYBER DATA 
#in city is:city driver_count type &   in ride: city date fare ride_id
#city in common, so merge the 2 on that column and then add city to end (the right of) of of the ride data DF 
#with the constraint of how to the left??

In [33]:
# Combine the data into a single dataset                                              called PYBER DATA
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame   now it looks like this combined data   
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban